---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.CurveFailures
source: html/d8139918-351e-f209-f2bd-439653322d56.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurveFailures

Failures about Curves and Curve-Driven Elements.

## Syntax (C#)
```csharp
public static class CurveFailures
```